import React from "react";
import styles from "./styles.module.css";

const ShapeOutside = () => {
  return (
    <div className={styles.body}>
      <h2 className={styles.title}>魔女の旅々</h2>
      <div className={styles.shape}></div>
      <img
        className={styles.shapeImg}
        src="images/001-removebg-preview.png"
        alt="Elaina"
      />
      <span className={styles.description}>
        魔法使いの国
        魔法使いの国で黒髪の少女サヤにぶつかられたイレイナは、その際に魔女の証であるブローチを紛失してしまう。イレイナはとりあえず、ブローチが見つかるまでという約束でサヤに魔法の修行をつけながら彼女のアルバイト先である宿で暮らすが、実はブローチはサヤによって盗まれていた。妹が故郷に帰ってしまったことによる孤独への寂しさから逃れようと嘘をついていたサヤをイレイナは諭し、自分の使っている帽子を渡して修行をつけた後、国を去る。それからしばらく経ったある日、遠くの街でイレイナはサヤが魔女になったことを知るのだった。
        花のように可憐な彼女
        旅の途中で綺麗な花畑を見つけたイレイナは、そこに佇む一人の少女（アルテミシア、声
        -
        巽悠衣子）から「誰にでもいいからこの花束を渡して欲しい」と花束を託される。それに応じて近くの街を訪ねると入口で門番（ソロル、声
        -
        山下大輝）に引き止められ、実は先ほどの花畑の花は魔法が使えない人間にとっては毒となるものであることを知る。翌日、少女のことが気になって花畑へ向かったイレイナが見たものは、少女と門番（実は少女の兄）が花の毒に侵されて絶命した姿だった。
        瓶詰めの幸せ
        空を飛んでいると急に呼び止める声を聞いてイレイナが近づいた少年エミル（声
        -
        市川蒼）が持っていたのは、「色々な幸せが詰まった瓶」だった。それを自分が好きな使用人の少女ニノ（声
        -
        佐藤聡美）にプレゼントするのだというエミルに連れられて家を訪ねると、そこにいたのは横暴な態度をしたエミルの父（声
        -
        てらそままさき）と、奴隷として虐げられているニノだった。ニノを元気づけるため、エミルは瓶を解放して色々な幸せの姿を見せる。まもなく旅立ったイレイナは、決して叶わない幸せを見せられて自ら命を絶った女性の物語を思い出すのだった。
        民なき国の王女
        旅の途中、イレイナは廃れている国を訪れる。一晩寝るための場所を探し、比較的元の形を保っている王宮に入ると、誰もいないと思っていたそこに一人の女性が現れる。そこにいたミラロゼ（声
        -
        Lynn）という記憶喪失の魔女によると、残されていた手紙に夜になるとジャバリエという魔物が現れ、それは王女である彼女にしか倒せないと書かれていたという。ミラロゼが考案した作戦のための罠作りは手伝ったもののそれ以降のことは手伝わずにイレイナは去るが、心配で戻った彼女が見たものは、罠に填めたジャバリエを痛めつけることに歓喜するミラロゼの姿だった。実はミラロゼはかつて愛する料理人の子を妊娠したが、王である父には身分の違いから結婚を認められず、恋人を目前で火炙りにされたうえに胎児も殺害されており、その恨みから父に呪いをかけて魔物に変え、国を滅ぼさせて大事なものを失うという絶望を父に味わせていた。翌日、イレイナは「旅をしてみようかしら」と言うミラロゼと別れ、旅を再開するのだった。
      </span>
    </div>
  );
};

export default ShapeOutside;
